## 🧾 Terraform Plan for `sec_sso_permissions_baseline`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_account_assignment.this["admin-group-prod"] will be created
  + resource "aws_ssoadmin_account_assignment" "this" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + permission_set_arn = (known after apply)
      + principal_id       = "08f7c0a3-41dd-4e99-b6cb-e2b25e2c1ab2"
      + principal_type     = "GROUP"
      + target_id          = "444455556666"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_account_assignment.this["billing-lead"] will be created
  + resource "aws_ssoadmin_account_assignment" "this" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + permission_set_arn = (known after apply)
      + principal_id       = "08f7c0a3-41dd-4e24-b6cb-e2b25e2c1ab2"
      + principal_type     = "USER"
      + target_id          = "111122223333"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_account_assignment.this["dev-team-staging"] will be created
  + resource "aws_ssoadmin_account_assignment" "this" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + permission_set_arn = (known after apply)
      + principal_id       = "08f7c0a3-41dd-4e99-b6cb-e2b25e3d3e3f"
      + principal_type     = "USER"
      + target_id          = "777788889999"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_managed_policy_attachment.this["AdminAccess-AdministratorAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "this" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/AdministratorAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_managed_policy_attachment.this["BillingAccess-Billing"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "this" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/job-function/Billing"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_managed_policy_attachment.this["DevOpsAccess-AWSCloudFormationFullAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "this" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/AWSCloudFormationFullAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_managed_policy_attachment.this["DevOpsAccess-AWSCodePipelineFullAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "this" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/AWSCodePipelineFullAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_permission_set.this["AdminAccess"] will be created
  + resource "aws_ssoadmin_permission_set" "this" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Full administrative privileges"
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + name             = "AdminAccess"
      + relay_state      = "https://console.aws.amazon.com/"
      + session_duration = "PT4H"
      + tags             = {
          + "Department" = "Platform Engineering"
          + "Owner"      = "Bluebit"
        }
      + tags_all         = {
          + "Department" = "Platform Engineering"
          + "Owner"      = "Bluebit"
        }
    }

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_permission_set.this["BillingAccess"] will be created
  + resource "aws_ssoadmin_permission_set" "this" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Billing and Cost Management"
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + name             = "BillingAccess"
      + session_duration = "PT2H"
      + tags             = {
          + "Department" = "Platform Engineering"
          + "Owner"      = "Bluebit"
        }
      + tags_all         = {
          + "Department" = "Platform Engineering"
          + "Owner"      = "Bluebit"
        }
    }

  # module.sso_permissions_baseline_advanced.aws_ssoadmin_permission_set.this["DevOpsAccess"] will be created
  + resource "aws_ssoadmin_permission_set" "this" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Access for developers and DevOps engineers"
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + name             = "DevOpsAccess"
      + session_duration = "PT2H"
      + tags             = {
          + "Department" = "Platform Engineering"
          + "Owner"      = "Bluebit"
        }
      + tags_all         = {
          + "Department" = "Platform Engineering"
          + "Owner"      = "Bluebit"
        }
    }

  # module.sso_permissions_baseline_basic.aws_ssoadmin_account_assignment.this["assignment1"] will be created
  + resource "aws_ssoadmin_account_assignment" "this" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + permission_set_arn = (known after apply)
      + principal_id       = "08f7c0a3-41dd-4e99-b6cb-e2b25e3d3e3f"
      + principal_type     = "USER"
      + target_id          = "111122223333"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso_permissions_baseline_basic.aws_ssoadmin_managed_policy_attachment.this["ViewOnlyAccess-ReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "this" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # module.sso_permissions_baseline_basic.aws_ssoadmin_permission_set.this["ViewOnlyAccess"] will be created
  + resource "aws_ssoadmin_permission_set" "this" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Grants read-only access"
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-EXAMPLE"
      + name             = "ViewOnlyAccess"
      + session_duration = "PT1H"
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->